pages/11_A_Cautionary_Winters_Tale.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="https://www.facebook.com/2008/fbml">
<head>
    <title> A Cautionary Winter's Tale.</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Open Graph tags -->

            <meta property="og:type" content="article"/>
            <meta property="og:title" content=" A Cautionary Winter's Tale."/>
            <meta property="og:url" content="http://thecastle.github.io/thecastle/pages/11_A_Cautionary_Winters_Tale.html"/>

    <!-- Bootstrap -->
        <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/bootstrap.readable.min.css" type="text/css"/>
    <link href="http://thecastle.github.io/thecastle/theme/css/font-awesome.min.css" rel="stylesheet">
    <link href="http://thecastle.github.io/thecastle/theme/css/pygments.css" rel="stylesheet">
    <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/style.css" type="text/css"/>
    <!-- JavaScript plugins (requires jQuery) -->


</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a href="http://thecastle.github.io/thecastle" class="navbar-brand">The Castle Mountaineering Club.</a>
        </div>
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
            </ul>
            <ul class="nav navbar-nav navbar-right">
                <li><a href="http://thecastle.github.io/thecastle/archives.html"><i class="icon-th-list"></i>Archives</a></li>
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
</nav>
<!-- /.navbar -->
<div class="container">
    <div class="row">
        <div class="col-lg-9">
    <section id="content" class="body">

        <div class="entry-content">
            
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">A Cautionary Winter&rsquo;s Tale</h2>
<div class="outline-text-2" id="text-1">
<div class="export">
<p>
&lt;p&gt;
&lt;em&gt;by Dave Kime&lt;/em&gt;
&lt;/p&gt;
</p>

</div>

<p>
It was the Club&rsquo;s Easter Meet in Glenshee 1978. Base camp
was established at our now traditional wild campsite by the
Clunie Water on the Braemar side of the Cairnwell. Good Friday
saw Harry, Charles, Anne, Jenny and myself crammed into the Maxi
with packs and camping gear for four days. The car was left in
the ski car park and a note  containing, in accordance with
official recommendations, details of party and destination  was
left at the ticket office - the official Mountain Rescue Centre.
We struggled, with full packs, up the chair lift and off to Loch
Vrotachan. Anne appeared somewhat nervous and apprehensive - she
said it was because she hadn&rsquo;t done much skiing, but in
retrospect I suspect it was well justified apprehension at the
thought of spending three nights with Harry and Charles.
</p>

<p>
The weather worsened as we skinned  up to Carn a&rsquo;Gheoidh,
and by Loch nan Eun spindrift was hurtling across the frozen
waters. Hardly a suitable campsite, but by dropping to the north
we found enough shelter by a peat hag to sort gear and pitch
camp. The peat was rock hard, so the tent was anchored only to
pegs buried in snow and well trampled.  Water was found at the
bottom of an  eight feet deep pot hole in the snow  with rather
delicate access. The two parties disappeared into their tents for
the night and emerged only when driven by overwhelming natural
necessity. Gales and snow swept around all night, occasionally
punctuated by  mysterious noises from the other tent. Even a cry
of help would not get us out tonight! Meanwhile, unbeknown to us,
back in civilization, police forces in five counties were
mobilising.
</p>

<p>
Come morning, the tent had survived and so had Anne. A sunny
start had us doing the Beinn Iutharns but we were soon back in
clag and Charles was having problems with his new high-tech
sticky skins which had taken a dislike to the cold weather. Gales
rose again that night and rising above them were intermittent
muffled screams. We pulled the hoods of our ducks over our heads
and pretended not to hear.
</p>

<p>
The tent had shrunk by next morning to half its former size
as the weight of snow pressed in. Charles and Harry assured us
that Anne was alright   she was less sure. Four of us skinned up
to Carn an Righ followed by Charles towing his skinless skis -
he&rsquo;d make a good doggie-walker! A superb run in powder snow down
to Gleann Mor made it all worthwhile. Back at camp, the bags were
getting damp and by next morning only the tips of the tent poles
were visible. With some difficulty, the pegs were unburied and
with full packs we had a great ski down to the Baddoch Burn  then
after a last skin up to Loch Vrotachan, we joined the crowds on
the Cairnwell run.
</p>

<p>
The car was still there, but Anne was convinced that someone
had been through her handbag but not taken any money - three
nights with Harry and Charles does take a little getting over!
Mugs of coffee in the cafe where we heard that Sheffield had been
cut off from the world, airports closed and the Glenshee Mountain
Rescue called out. Well, it had been a bit wild. A little later I
wandered over to the counter to report our safe return.
</p>

<p>
&ldquo;Er, yes, er, just a, er, minute&rdquo; said the lad  and
disappeared to return with the manager and Leader of the Mountain
Rescue Team.
</p>

<p>
Over the next few weeks the story was pieced together. By
nine at night the white Maxi stood in splendid isolation in the
middle of the empty car park. The police were informed and the
car number dispatched for the Swansea computer to work on.
Meanwhile, back at base Kate and Al had arrived and were settling
in for the night. Kate was rudely disturbed from a privy squat by
powerful torches, Land Rovers and the full might of the Braemar
police force. Somewhat shaken by this disturbance Kate was
interrogated about the whereabouts of the Kime party. The officer
did not react very kindly when told that these malingerers were
camping in the hills. Meanwhile two mountain rescue teams had
assembled and the ski tows were brought into operation to search
for the &ldquo;lost&rdquo; skiers.
</p>

<p>
The Swansea computer had informed the Braemar and Sheffield
constabularies of the identity of the owner of the Maxi.
</p>

<p>
At Hallamshire Close, Sheffield, the Kime house was empty
so the neighbours were knocked up for questioning.
</p>

<p>
&ldquo;Oh, they&rsquo;re camping in Scotland somewhere.&rdquo;
</p>

<p>
&ldquo;Yes, we&rsquo;ve just found their car - nothing in it but an old
pair of wellington boots and a ladies handbag.&rdquo; ,!
Leaving our friends to the vision of their eccentric
neighbours barefoot on the mountain, the officers departed. An
hour later, our friends phoned West Bar police station in
Sheffield when they remembered where Jenny&rsquo;s father worked.
Across the Pennines, the University night porter was awoken from
his duties and questioned as to the whereabouts of the Professor
of Engineering. Lancaster Constabulary found his house empty as
well.
</p>

<p>
&ldquo;He&rsquo;s in Scotland&rdquo; said the neighbours   &ldquo;at the cottage.&rdquo;
</p>

<p>
No way were the Inverness Constabulary in Fort William going
to drive two hours to that address at that time of night: a phone
call to their local contact would have to suffice. Campbell
Morrison was dragged from behind the bar at the Clan to drive
three miles, wake up the Professor and bring him to the phone.
</p>

<p>
&ldquo;They&rsquo;re camping in the hills and they know what they&rsquo;re
doing. Call your rescue off!&rdquo;
</p>

<p>
The message got back to Braemar and all teams were stood
down. The Braemar police, on returning to base, stopped by to
rouse Kate and Al again in order to tell them in no uncertain
terms that Dr. Kime was to report to the police station
IMMEDIATELY he got back.
</p>

<p>
Next morning the staff were back  at work at the ski centre
and as the ticket office opened, the lad put his hand in his
pocket.
</p>

<p>
&ldquo;Och, Hamish, a laddie left me this note yesterd&#x2026;..&rdquo; As
Hamish said: &ldquo;The lads dealt with him - he won&rsquo;t forget again in
a hurry.&rdquo;
</p>

<p>
Back to base camp in the glen where we discovered that our
tent had disappeared, then found the shreds neatly folded and
packed in Charles&rsquo; tent. Kate and Al returned from a day of
ticking and passed on the message.  ,   -  Down to Braemar.
</p>

<p>
&ldquo;My name&rsquo;s Kime, I believe you want to question me in
connection with&#x2026;&rdquo;
</p>

<p>
&ldquo;Och, that fiasco on Friday, come on in.&rdquo;
</p>

<p>
Somewhere in all this there must be a moral   about parked
cars, about leaving  notes to the  police, and rescue teams being
called out unnecessarily, and of training and certificates  and
of the freedom to roam the hills unhindered and to  take
responsibility for one&rsquo;s own safety and actions?
</p>
</div>
</div>

        </div>
    </section>
        </div>
        <div class="col-lg-3 well well-sm" id="sidebar">

<aside>
    <section>

        <ul class="list-group list-group-flush">
             <li class="list-group-item"><h4><i class="icon-search icon-large"></i>Search</h4></li>

                   <li class="list-group-item"><h4><i class="icon-book icon-large"></i>Pages</h4></li>



                <li class="list-group-item"><a href="http://thecastle.github.io/thecastle/tags.html"><h4><i class="icon-tags icon-large"></i>Tags</h4></a></li>
        </ul>
    </section>
</aside>        </div>
    </div>
</div>
<footer>
    <div class="container">
        <hr>
        <p class="pull-right"><i class="icon-arrow-up"></i> <a href="#">Back to top</a></p>


        <p>&copy;  The Castle Mountaineering Club. &middot; Powered by <a href="https://github.com/DandyDev/pelican-bootstrap3" target="_blank">pelican-bootstrap3</a>,
            <a href="http://docs.getpelican.com/" target="_blank">Pelican</a>,
            <a href="http://getbootstrap.com" target="_blank">Bootstrap</a></p>
    </div>
</footer>
<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="http://thecastle.github.io/thecastle/theme/js/bootstrap.min.js"></script>

<!-- Enable responsive features in IE8 with Respond.js (https://github.com/scottjehl/Respond) -->
<script src="http://thecastle.github.io/thecastle/theme/js/respond.min.js"></script>


</body>
</html>